<<<<<<< HEAD
read_liberty -lib lib/harshith/home/ALU-Control-Project/rtl/multicore1.v/sky130_fd_sc_hd__tt_025C_1v80.lib
read_verilog multicore1.v 
synth -top multicore1
dfflibmap -liberty lib/harshith/home/ALU-Control-Project/rtl/multicore1.v/sky130_fd_sc_hd__tt_025C_1v80.lib
=======
read_liberty -lib lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_verilog multicore_alu.v 
synth -top multicore_alu
dfflibmap -liberty lib/sky130_fd_sc_hd__tt_025C_1v80.lib
>>>>>>> origin/main
opt -purge 
abc -liberty lib/sky130_fd_sc_hd__tt_025C_1v80.lib
write_verilog -noattr multicore_tt_025C_1v80.v

